# Необходимо написать программу, которая получает на  входе число и выводит слово "Odd" если число четное.
# Если число четное и в диапазоне от 2 до 27,
# то выводит "In first range", если число нечетное и в диапазоне от 29 до 53,
# то выводит "In second range",
# во всех других случаях "It's something".
input('Put the number')
a=input()
print(a)