#Необходимо написать программу, которая будет принимать на входе два числа
#и выводить первой строкой целочисленное частное этих двух чисел (округлить всегда в меньшую сторону),
# второй строкой - дробное частное.
a = (input('Put the number :'))
b = (input('Put the number :'))
c = int((float(a))//(float(b)))
d = int((float(a))/(float(b)))
print(c)
print(d)
#print(int(a)//int(b))
#print(float(a)/float(b))


