#Необходимо написать программу,
#которая на входе будет принимать строку,
#а выводить ее на экран будет первые двадцать символов
# (если эта длинна разрывает слово, то необходимо печатать слово целиком),
# затем продолжать на новой строке и делать 4 отступа вначале и снова двадцать символов.
# Так необходимо выводить всю фразу целиком. Обрывать слова нельзя.
a = input()
s_=[0:20:1]
print(s
