# 6. Написать программу, которая будет считать квадратный корень переданного ей числа
# (нельзя использовать сторонние библиотеки).
x = float(input('Введите число'))
print(x ** 0.5)