# # 9. Написать программу, которая будет выводить список всех четных чисел, которые идут по списку после числа 237.
# Список -
numbers = [386, 462, 47, 418, 907, 344, 236, 375, 823, 566, 597, 978, 328, 615, 953, 345, 399, 162, 758, 219, 918, 237, 412, 566, 826, 248, 866, 950, 626, 949, 687, 217, 815, 67, 104, 58, 512, 24, 892, 894, 767, 553, 81, 379, 843, 831, 445, 742, 717, 958,743, 527]
numbers.sort()
index_237 = numbers.index(237)
print(index_237)
new_list = numbers[index_237:-1]
answer_list = []
for i in new_list:
    if i % 2 == 0:
        answer_list.append(i)
print(answer_list)