# #Необходимо написать программу, которая будет принимать на входе два числа
# #и выводить первой строкой целочисленное частное этих двух чисел (округлить всегда в меньшую сторону),
# # второй строкой - дробное частное.
a = ((input('Put the number :')))
b = ((input('Put the number :')))
print(int(a) // int(b))
print(float(a)/float(b))
