# # 4. Необходимо написать программу, которая на входе будет принимать строку,
# # а выводить ее на экран будет первые двадцать символов
# # (если эта длинна разрывает слово, то необходимо печатать слово целиком),
# # затем продолжать на новой строке и делать 4 отступа вначале и снова двадцать символов.
# # Так необходимо выводить всю фразу целиком. Обрывать слова нельзя.
#s = input('введите строку')
text = 'Hi my name is PavelssI am glad to see you here! What do you think about this?'.split() # Это последовательность строк.
list()


s = " "



s.append(i)
while len(i) <= 20:
        for i in text:
            i = i + i
print(len(s.join(i)))




# for i in range(text[20:]):
#     print(text[0:20])
# while i != ' ':
#     i = i + 1
# print(text[0:i])
#
# #for i in s:
# #    if \s - пробел
# #end = ' '
# index = text[20]
# while index != ' ':
#     index = index + 1
# else: print(index)

#if text[20] == " ":
#    print(text[0:20])
#        elif text[21]

#Мне надо посчитать в каком индексе начиная с 20-го находится пробел Вывести этот индекс в переменную которая сделает срез строки и прибавит 4 пробела

