# 6. Необходимо написать программу, которая принимает на входе радиус и выводит на экран площадь круга.
r = int(input("введите значение радиуса"))
s = 3.14 * r ** 2
print("Площадь круга равна: ", s)